## 01. PyMySQL - Student Databases

In [1]:
import mysql.connector
import pandas as pd

mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = '@Ravenclaw93',
    database = 'student_performance'
)

## No. 1

In [40]:
mycursor = mydb.cursor()
query = (
    'select school.name, students.sex, round(AVG(students.age),2) as avg_age from school, students where students.school_id = school.id GROUP BY sex, school_id;'
    )
mycursor.execute(query)
result = mycursor.fetchall()
ans1 = pd.DataFrame(result, columns=mycursor.column_names)
ans1

                   name sex avg_age
0       Gabriel Pereira   F   16.67
1       Gabriel Pereira   M   16.52
2  Mousinho da Silveira   M   17.20
3  Mousinho da Silveira   F   17.01

## No. 2

In [97]:
mycursor = mydb.cursor()
query = (
    'SELECT count(distinct(student_id)) as num_of_student FROM students, students_family WHERE famsize = 6 AND m_job <> f_job AND sex ="M";'
    )
mycursor.execute(query)
result = mycursor.fetchall()
ans2 = pd.DataFrame(result, columns=mycursor.column_names)
ans2

   num_of_student
0              43

## No. 3

In [119]:
mycursor = mydb.cursor()
query = (
    'Select students.name, students_profile.student_id from students join students_profile on students.id = students_profile.student_id where students_profile.internet = "no" and students_profile.higher_edu = "yes" and students_profile.study_time/60 > 5 order by students_profile.student_id;'
    )
mycursor.execute(query)
result = mycursor.fetchall()
ans3 = pd.DataFrame(result, columns=mycursor.column_names)
ans3

                  name  student_id
0          Mike Burton     1400105
1         Joshua Magee     1400221
2       Bernice Seibel     1400262
3          Wayne Roach     1400263
4          Jesus Field     1400282
5      Roger Nicholson     1400293
6          Edna Lozano     1400334
7    Marlene Donnelson     1400336
8        Greta Burrell     1400372
9        Dara Spradlin     1400385
10      Don Greenfield     1400500
11     Cesar Hernandez     1400630
12       Alan Simpkins     1400688
13       Carrie Bailey     1400697
14         Jimmy Mcgee     1400698
15     William Facundo     1400722
16      Arthur Roberts     1400733
17      Julius Gaskill     1400785
18      Allison Tsasie     1400848
19          Joan Vogel     1400849
20        Ollie Martel     1400854
21  Catherine Alvarado     1400858
22         Marsha Timm     1400870
23       Thomas Paneto     1400892
24        Mark Miranda     1400897
25         Mary Miller     1400902
26       Eddie Meltzer     1400922
27    Steven Alexander     1400931
28        Samantha Faw     1400933
29        Jerry Belton    14001023
30      Evon Weinzierl    14001036

## No. 4

In [148]:
mycursor = mydb.cursor()
query = (
    'Select max(parent_job.occupation) as occupations, count(distinct(parent_job.occupation)) as num_of_fathers from students_family join parent_job on students_family.m_edu = parent_job.id;'
    )
mycursor.execute(query)
result = mycursor.fetchall()
ans4 = pd.DataFrame(result, columns=mycursor.column_names)
ans4

  occupations  num_of_fathers
0     teacher               5

## No. 5

In [189]:
mycursor = mydb.cursor()
query = (
    'select students_profile.student_id, name, name from students join students_profile on students.id = students_profile.student_id where sex = "M" and address <> "Urban" order by age desc , num_of_absences desc , free_time desc limit 7;'
    )
mycursor.execute(query)
result = mycursor.fetchall()
ans5 = pd.DataFrame(result, columns=mycursor.column_names)
ans5

   student_id                name                name
0     1400808           Jamie Cox           Jamie Cox
1     1400392    Daniel Applegate    Daniel Applegate
2     1400969        Brian Theall        Brian Theall
3     1400972        Sara Eubanks        Sara Eubanks
4     1400350       Gisele Blount       Gisele Blount
5     1400353  Matthew Montgomery  Matthew Montgomery
6     1400975      Carman Wolcott      Carman Wolcott